{
  "results": [
    {
      "id": 1,
      "title": "Inception",
      "overview": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.",
      "director": "Christopher Nolan"
    },
    {
      "id": 2,
      "title": "The Dark Knight",
      "overview": "When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
      "director": "Christopher Nolan"
    },
    {
      "id": 3,
      "title": "Pulp Fiction",
      "overview": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
      "director": "Quentin Tarantino"
    },
    {
      "id": 4,
      "title": "The Shawshank Redemption",
      "overview": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
      "director": "Frank Darabont"
    },
    {
      "id": 5,
      "title": "The Godfather",
      "overview": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
      "director": "Francis Ford Coppola"
    },
    {
      "id": 6,
      "title": "Fight Club",
      "overview": "An insomniac office worker and a devil-may-care soapmaker form an underground fight club that evolves into something much, much more.",
      "director": "David Fincher"
    },
    {
      "id": 7,
      "title": "The Matrix",
      "overview": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.",
      "director": "Lana and Lilly Wachowski"
    },
    {
      "id": 8,
      "title": "Goodfellas",
      "overview": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.",
      "director": "Martin Scorsese"
    },
    {
      "id": 9,
      "title": "Interstellar",
      "overview": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.",
      "director": "Christopher Nolan"
    },
    {
      "id": 10,
      "title": "The Silence of the Lambs",
      "overview": "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.",
      "director": "Jonathan Demme"
    },
    {
      "id": 11,
      "title": "Blade Runner 2049",
      "overview": "A young blade runner's discovery of a long-buried secret leads him to track down former blade runner Rick Deckard, who's been missing for thirty years.",
      "director": "Denis Villeneuve"
    },
    {
      "id": 12,
      "title": "The Avengers",
      "overview": "Earth's mightiest heroes must come together and learn to fight as a team if they are going to stop the mischievous Loki and his alien army from enslaving humanity.",
      "director": "Joss Whedon"
    },
    {
      "id": 13,
      "title": "Parasite",
      "overview": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
      "director": "Bong Joon-ho"
    },
    {
      "id": 14,
      "title": "Joker",
      "overview": "In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He then embarks on a downward spiral of revolution and bloody crime. This path brings him face-to-face with his alter-ego: the Joker.",
      "director": "Todd Phillips"
    },
    {
      "id": 15,
      "title": "Avatar",
      "overview": "A paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.",
      "director": "James Cameron"
    },
    {
      "id": 16,
      "title": "Titanic",
      "overview": "A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.",
      "director": "James Cameron"
    },
    {
      "id": 17,
      "title": "Mad Max: Fury Road",
      "overview": "In a post-apocalyptic wasteland, a woman rebels against a tyrannical ruler in search for her homeland with the aid of a group of female prisoners, a psychotic worshiper, and a drifter named Max.",
      "director": "George Miller"
    },
    {
      "id": 18,
      "title": "The Incredibles",
      "overview": "A family of undercover superheroes, while trying to live the quiet suburban life, are forced into action to save the world.",
      "director": "Brad Bird"
    },
    {
      "id": 19,
      "title": "Spirited Away",
      "overview": "During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.",
      "director": "Hayao Miyazaki"
    },
    {
      "id": 20,
      "title": "The Lion King",
      "overview": "Lion cub and future king Simba searches for his identity. His eagerness to please others and penchant for testing his boundaries sometimes gets him into trouble.",
      "director": "Roger Allers, Rob Minkoff"
    },
    {
      "id": 21,
      "title": "The Social Network",
      "overview": "As Harvard student Mark Zuckerberg creates the social networking site that would become known as Facebook, he is sued by the twins who claimed he stole their idea, and by the co-founder who was later squeezed out of the business.",
      "director": "David Fincher"
    },
    {
      "id": 22,
      "title": "Whiplash",
      "overview": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential.",
      "director": "Damien Chazelle"
    },
    {
      "id": 23,
      "title": "Get Out",
      "overview": "A young African-American visits his white girlfriend's parents for the weekend, where his simmering uneasiness about their reception of him eventually reaches a boiling point.",
      "director": "Jordan Peele"
    },
    {
      "id": 24,
      "title": "The Grand Budapest Hotel",
      "overview": "A writer encounters the owner of an aging high-class hotel, who tells him of his early years serving as a lobby boy in the hotel's glorious years under an exceptional concierge.",
      "director": "Wes Anderson"
    },
    {
      "id": 25,
      "title": "Forrest Gump",
      "overview": "The presidencies of Kennedy and Johnson, the events of Vietnam, Watergate, and other historical events unfold through the perspective of an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.",
      "director": "Robert Zemeckis"
    },
    {
      "id": 26,
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "overview": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
      "director": "Peter Jackson"
    },
    {
      "id": 27,
      "title": "Dune",
      "overview": "Feature adaptation of Frank Herbert's science fiction novel, about the son of a noble family entrusted with the protection of the most valuable asset and most vital element in the galaxy.",
      "director": "Denis Villeneuve"
    },
    {
      "id": 28,
      "title": "No Time to Die",
      "overview": "James Bond has left active service. His peace is short-lived when Felix Leiter, an old friend from the CIA, turns up asking for help, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.",
      "director": "Cary Joji Fukunaga"
    },
    {
      "id": 29,
      "title": "The Green Mile",
      "overview": "The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.",
      "director": "Frank Darabont"
    },
    {
      "id": 30,
      "title": "Eternal Sunshine of the Spotless Mind",
      "overview": "When their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories.",
      "director": "Michel Gondry"
    }
  ]
}